# print('Привет')
# print('Как дела?')

# Отступы внутри def, if, while, for и т.п.
# def function():
# 	pass
# for x in xrange(1,10):
# 	if :
# 		pass

# Однострочный комментарий

'''
строка 1
строка 2
'''
"""
строка 1
строка 2
"""

# Целое число. -3,-2,-1,0,1,2,3 Тип данных - Integer (int)
# my_int = 5
# print(my_int)
# print(type(my_int))

# Число с плавающей точкой (вещественное число). -5.2, -14.8, 3.5 Тип данных - float (float)
# my_float = 15.65
# print(my_float)
# print(type(my_float))

# Сложение
# print(5 + 10) # 15
# print(5 + 3.6) # 8.6
# print(2.4 + 6.2) # 8.6
# print(0.1 + 0.2) # 0.30000000000000004

# Вычитание
# print(10 - 7) # 3
# print(50 - 20.5) # 29.5

# Умножение
# print(3 * 5) # 15
# print(20 * 1.5) # 30.0
# print(1.2 * 4) # 4.8

# Деление
# print(30 / 10) # 3.0
# print(50 / 6.5) # 7.6923076923076925

'''
Закомментировать, раскомментировать многострочный код в текстовом редакторе 
Sublime Text можно с помощью комбинации клавиш "Сtrl" + "/". 
 '''

# Преобразование вещественного числа в целое осуществляется с помощью функции int()
# print(int(30 / 10)) # 3
# print(int(50 / 6.5)) # 7

# Преобразование целого числа в вещественное осуществляется с помощью функции float()
# print(float(3 * 5)) # 15.0
# print(float(20 + 15)) # 35.0

# Деление по модулю возвращает остаток от деления. Вычисляется с помощью символа процент "%".
# print(20 % 3) # 2
# print(25 % 5) # 0

# Целочисленное деление
# print(20 // 3) # 6
# print(25 // 3.5) # 7.0

# Возведение в степень. Вычисление квадратного корня
# print(2 ** 4) # 16
# print(5 ** 2) # 25
# print(100 ** 0.5) # 10.0
# print(25 ** 0.5) # 5.0

# Округление чисел, функция round(x)
# print(round(4.7)) # 5
# print(round(4.3)) # 4
# print(round(4.5)) # 4

'''
Округление чисел с указанием знаков после запятой, 
функция round(x, n), где n - количество знаков после запятой
'''
# print(round(4.862465, 2)) # 4.86
# print(round(4.4567832, 3)) # 4.457

# Поиск минимального значения, функция min(2, 7, -5, 11)
# print(min(2, 7, -5, 11)) # -5

# Поиск максимального значения, функция max(2, 7, -5, 11)
# print(max(2, 7, -5, 11)) # 11

# Модуль числа, функция abs(x), отбрасывает знак минус
# print(abs(-5)) # 5
# print(abs(-5.75)) # 5.75

# Переменные
# x = 1
# print(x)
# x = 5
# print(x)
# my_int1 = 10
# _myInt1 = 100
# my_int1, my_int2 = (10, 50)
# print(my_int1, my_int2)

# CONST = 20

# Булевы значения
bool_true = True 
bool_false = False 
print(type(bool_true))
print(type(bool_false))
bool_int = 10
print(bool(bool_int))
my_bool1 = None # не определена, но объявлена
my_bool2 = "" # пустая строка
my_bool3 = 0 # ноль
my_bool4 = [] # пустой список
my_bool5 = {} # пустой словарь
my_bool6 = () # пустой кортеж
print(bool(my_bool1))
print(bool(my_bool2))
print(bool(my_bool3))
print(bool(my_bool4))
print(bool(my_bool5))
print(bool(my_bool6))